{
  "doc-f175693f2fef5bbb8a2be3fb78e304d0": {
    "content": "Automated Reasoning – Engineering AI Agents\nEngineering AI Agents\nBOOK\nFoundations\nTraining Deep Networks\nPerception\nKinematics\nState Estimation\nLarge Language Models\nMultimodal Reasoning\nTask Planning\nGlobal Planning\nLocal Planning\nMarkov Decision Processes\nReinforcement Learning\nVLA Agents\nCOURSES\nIntroduction to AI\nAI for Robotics\nDeep Learning for Computer Vision\nDATA MINING - BEING PORTED\nMEDIA\nAI for Robotics\nABOUT ME\n \n \nLogical Reasoning\nAutomated Reasoning\nIntroduction\nSyllabus\nRules, rule the world\nAI Agents\nFoundations\nFoundations\nDeep Neural Networks\nTraining Deep Neural Networks\nPerception\n2D Perception\nRecursive State Estimation\nState Estimation\nLarge Language Models\nLarge Language Models\nLogical Reasoning\nAutomated Reasoning\nWorld Models\nLogical Inference\nLogical Agents\nPlanning\nTask Planning\nActing - Markov Decision Processes\nMarkov Decision Processes\nActing - Reinforcement Learning\nReinforcement Learning\nMath Background\nMath for ML Textbook\nProbability Basics\nLinear Algebra for Machine Learning\nCalculus\nResources\nSubmitting Your Assignment / Project\nYour Programming Environment\nLearn Python\nAssignments\nAssignment 1 (undergrad)\nAssignment 1 (grad)\nAssignment 2\nAssignment 3\nAssignment 4\nProject\nIntroducing Erica - Your AI Tutor\nOn this page\nSecuring the cloud - automated reasoning\nEdit this page\nView source\nReport an issue\nLogical Reasoning\nAutomated Reasoning\nAutomated Reasoning\nWe have seen in an earlier chapter where we introduced a \ndynamical system\n governing the state evolution of the environment that a state is composed of variables and such \nfactored representations\n are key in allowing \nreasoning\n at the \nbelief\n space that are efficiently computed using recursive state estimators. We called this subsystem \nprobabilistic reasoning\n subsystem and we positioned it immediately after the reflexive perception for a good reason. It is processing a very high ‘bandwidth’ state information that is noisy and needs to be filtered by - you guessed it - Bayesian filters to make it very useful for the subsequent upstream services of the AI system.\nIn this chapter we will see another powerful representation, \ninternal\n to the agent, that can help agents to \nreason\n by expressing assertions about the world. These assertions are called \nsentences\n and are expressed in a \nknowledge representation language\n that is used to build a \nKnowledge Base (KB)\n - a concept central to AI. The KB starts with prior knowledge about the domain and problem at hand and incrementally is updated with the output of the probabilistic reasoning subsystem.\nLets see a concrete example as described in the figure below,\n \nImagine that the agent is a security robot at an airport and is moving around that environment. The problem it tries to solve is to identify an abandoned backpack / luggage.\nDespite the simplicity of the problem statement this is a very challenging problem to solve. To begin with the robot must be creating static maps of the environment to be able to navigate it. Closer to the core task, we will need to preprogram the agent with all sorts of deep learning models to be able to even recognize backpacks or other luggage items via its perception system. The agent must be able to distinguish a situation where the backpack that was left behind by its carrier (a person) to a companion traveler (another person) to e.g. visit the restroom from the situation where the backpack was left behind maliciously. Unique object IDs must be assigned (symbolic segmentation) to persons and a very accurate scene graph must also be generated by its probabilistic reasoning system. It does not stop there as relational information must be generated to associate objects (e.g. carriers and pieces of luggage) and such information must be stored in the KB but perhaps more importantly the agent must be able to \nreason\n using the stored information in the KB.\nSecuring the cloud - automated reasoning\nLogical reasoning is used not only for scene analytics. AWS was the first cloud provider to recognize its significance and the following video shows why and what they have developed in this space. To the best of our knowledge (minus military applications we don’t know) this is the largest deployment of logical reasoning technology to this day.\n \nAWS re:Inforce 2019: The Evolution of Automated Reasoning Technology at AWS\nStill to \nlearn\n the value of logical reasoning you need to go to simpler domains / worlds than scene analytics and cloud networking - world models that are simple and instructive.\n \nWorld Models\n \n \nEdit this page\nView source\nReport an issue"
  }
}